gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/server.cpp
  else if (alarmState == 3)
    message += F("<message_ok> Wasserstand ist zwischen " Level_AL_Str " und " Level_AH_Str " <br></message_ok>");

  else if (alarmState == 2)
    message += F("<message_ok>   Wasserstand &lt; " Level_AL_Str "<br></message_ok>");
  else
    message += F("<message_ok>   Wasserstand &lt; " Level_AL_Str "<br>Alarmstate 1/0 <br></message_ok>");

  //------------------------------------------------
  // print when a new value arrives
  message += F("<br><br>  Zeit: ");
  message += formattedTime;
  message += F("   Wasserstand aktuell: ");
  message += myValueFilteredAct;

  //-----------------------------------------------------------------------------------------
  // End of show message depending of alarmstate
  message += F("</article>");

  //-----------------------------------------------------------------------------------------
  // Simulation
  message += F("<article>\n"
  //-----------------------------------------------------------------------------------------
  "<h2>Simulation</h2>\n" 
  "<p>Zum Einschalten der Simulation klicke auf den obersten Schalter "
  "<br>rot : Debug ein"
  "<br><br>Um die Relais Eingänge zu schalten, klicke auf den entsprechenden Schalter<br>"
  "<br>AHH / AH : rot   --> überschritten"
  "<br>AHH / AH : grau  --> unterschritten"
  "<br>    / AL : grün  --> unterschritten"
  "<br>    / AL : grau  --> überschritten"
  "</p>");
  if (debugLevelSwitches == 1) // simulation aktiv = rot
  {
    message += F("<p class='on_red'><a href='c.php?toggle=a' target='i'>Debug</a></p>\n");
  } else {
    message += F("<p class='off'><a href='c.php?toggle=a' target='i'>Debug</a></p>\n");
  }
  if (simVal_AHH == 0)  // low active => 0 = on = rot = higher than AHH
  {
  message += F("<p class='on_red'><a href='c.php?toggle=1' target='i'>AHH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=1' target='i'>AHH</a></p>\n");
  }
  if (simVal_AH == 0) // low active => higher than AH
  {
  message += F("<p class='on_red'><a href='c.php?toggle=2' target='i'>AH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=2' target='i'>AH</a></p>\n");
  }
  if (simVal_AL == 0)  // low active => 0 = on = green => lower! than
  {
  message += F("<p class='on_green'><a href='c.php?toggle=3' target='i'>AL</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=3' target='i'>AL</a></p>\n");
  }

  message += F("<p class='off'><a href='c.php?toggle=5' target='i'>LED</a></p>\n"
  "<iframe name='i' style='display:none' ></iframe>\n" // hack to keep the button press in the window
  //-----------------------------------------------------------------------------------------
  // end of simulation
  "</article>\n");

  // // add slider for waterlevel
  // message += F("<article>\n"
  // "<h2>Slider</h2>\n" 
  // "<div class='slidecontainer'>\n"
  // "<input type='range' min='1' max='100' value='50' class='slider' id='myRange'>\n"
  // "</div>");

  addBottom(message);
  server.send(200, "text/html", message);
}
//*********************************************************************************
void handleSlider()
//*********************************************************************************
{
  String message;
  addTop(message);

  message += F(

               "<!DOCTYPE html>"
               "<html>"
               "<head>"
               "<meta name='viewport' content='width=device-width, initial-scale=1'>"
               "<style>"
               ".slidecontainer {"
               "  width: 100%;"
               "}"
               ""
               ".slider {"
               "  -webkit-appearance: none;"
               "  width: 100%;"
               "  height: 25px;"
               "  background: #d3d3d3;"
               "  outline: none;"
               "  opacity: 0.7;"
               "  -webkit-transition: .2s;"
               "  transition: opacity .2s;"
               "}"
               ""
               ".slider:hover {"
               "  opacity: 1;"
               "}"
               ""
               ".slider::-webkit-slider-thumb {"
               "  -webkit-appearance: none;"
               "  appearance: none;"
               "  width: 25px;"
               "  height: 25px;"
               "  background: #04AA6D;"
               "  cursor: pointer;"
               "}"
               ""
               ".slider::-moz-range-thumb {"
               "  width: 25px;"
               "  height: 25px;"
               "  background: #04AA6D;"
               "  cursor: pointer;"
               "}"
               "</style>"
               "</head>"
               "<body>"
               ""
               "<h1>Custom Range Slider</h1>"
               "<p>Drag the slider to display the current value.</p>"
               ""
               "<div class='slidecontainer'>"
               "  <input type='range' min='1' max='100' value='50' class='slider' id='myRange'>"
               "  <p>Value: <span id='demo'></span></p>"
               "</div>"
               ""
               "<script>"
               "var slider = document.getElementById('myRange');"
               "var output = document.getElementById('demo');"
               "output.innerHTML = slider.value;"
               ""
               "slider.oninput = function() {"
               "  output.innerHTML = this.value;"
               "}"
               "</script>"
               ""
               "</body>"
               "</html>");

              addBottom(message);
              server.send(200, "text/html", message);
};
//*********************************************************************************



//*********************************************************************************
/* print value history*/
void handleListFiltered()
//*********************************************************************************
{
  // what string length do we need?
  //   listing shortterm 
  //   - per line 25
  //   - 100 lines
  //   listing longterm
  //   - per line 25
  //   - 120 lines
  //  sum: 550 character without header and footer
  // 1 - message length: 513
  // 2 - message length: 3909
  
  String message = "";
  message.reserve(35000);

  String formattedTimeL= "";
  String formattedDateL= "";

  int iLine = iRingValueMax;

  addTop(message);

  Serial.print("1 - message length: "); 
  Serial.println(message.length());

  //------------------------------------------------------------------
  // shortterm values
  //-------------------------------------------------------------------
  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" 
               "<p>Shortterm values<br>Index ");
  message += filterCnt;             
  message += "<br> </p>";

  // create header of table
  message += "<pre>rdRingPtr  Time     Value ADC <br>";
  
  // read out ringbuffer and display values, but not more than maxLines lines
  for ( rdRingPtr = wrRingPtr+1; (rdRingPtr != wrRingPtr); ){
    // print only the last lines
    if (iLine <= maxLines) {
      message += rdRingPtr;
      message += "       ";

      formatDateAndTime(formattedTimeL, formattedDateL, ringTime[rdRingPtr]);
      message += formattedTimeL;

      message += "  ";
      message += ringValue[rdRingPtr];
      message += "  ";
      message += ringADC[rdRingPtr];
      message += "<br>";
      
